# Kegiatan 1 : Pengenalan Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  0.716049  1.615724 -0.263335 -1.060397
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-03  1.158555 -1.316103  0.061438 -0.477489
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812
2013-01-05 -0.093003 -1.293475  0.156667  0.027981
2013-01-06 -1.531764 -1.028076 -1.760545  0.714193

In [13]:
df2 = pd.DataFrame({'A' : 1.,
                   'B' : pd.Timestamp('20130102'),
                   'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D' : np.array([3] * 4,dtype='int32'),
                   'E' : pd.Categorical(["test","train","test","train"]),
                   'F' : 'foo' })

In [14]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df.head()

                   A         B         C         D
2013-01-01  0.716049  1.615724 -0.263335 -1.060397
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-03  1.158555 -1.316103  0.061438 -0.477489
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812
2013-01-05 -0.093003 -1.293475  0.156667  0.027981

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812
2013-01-05 -0.093003 -1.293475  0.156667  0.027981
2013-01-06 -1.531764 -1.028076 -1.760545  0.714193

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[ 0.7160486 ,  1.61572432, -0.26333545, -1.06039714],
       [-0.63982935,  1.25794332, -0.48043972,  0.16572744],
       [ 1.15855495, -1.31610345,  0.06143754, -0.47748943],
       [-0.18692204,  0.39372802, -1.2955127 , -0.06181207],
       [-0.09300306, -1.29347463,  0.15666744,  0.02798094],
       [-1.53176382, -1.02807621, -1.76054476,  0.7141927 ]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.096152 -0.061710 -0.596955 -0.115300
std    0.959039  1.325693  0.770484  0.602464
min   -1.531764 -1.316103 -1.760545 -1.060397
25%   -0.526603 -1.227125 -1.091744 -0.373570
50%   -0.139963 -0.317174 -0.371888 -0.016916
75%    0.513786  1.041889 -0.019756  0.131291
max    1.158555  1.615724  0.156667  0.714193

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.716049   -0.639829    1.158555   -0.186922   -0.093003   -1.531764
B    1.615724    1.257943   -1.316103    0.393728   -1.293475   -1.028076
C   -0.263335   -0.480440    0.061438   -1.295513    0.156667   -1.760545
D   -1.060397    0.165727   -0.477489   -0.061812    0.027981    0.714193

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.060397 -0.263335  1.615724  0.716049
2013-01-02  0.165727 -0.480440  1.257943 -0.639829
2013-01-03 -0.477489  0.061438 -1.316103  1.158555
2013-01-04 -0.061812 -1.295513  0.393728 -0.186922
2013-01-05  0.027981  0.156667 -1.293475 -0.093003
2013-01-06  0.714193 -1.760545 -1.028076 -1.531764

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  1.158555 -1.316103  0.061438 -0.477489
2013-01-05 -0.093003 -1.293475  0.156667  0.027981
2013-01-06 -1.531764 -1.028076 -1.760545  0.714193
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-01  0.716049  1.615724 -0.263335 -1.060397

In [25]:
df['A']

2013-01-01    0.716049
2013-01-02   -0.639829
2013-01-03    1.158555
2013-01-04   -0.186922
2013-01-05   -0.093003
2013-01-06   -1.531764
Freq: D, Name: A, dtype: float64

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01  0.716049  1.615724 -0.263335 -1.060397
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-03  1.158555 -1.316103  0.061438 -0.477489

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-03  1.158555 -1.316103  0.061438 -0.477489
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812

In [29]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.716049  1.615724
2013-01-02 -0.639829  1.257943
2013-01-03  1.158555 -1.316103
2013-01-04 -0.186922  0.393728
2013-01-05 -0.093003 -1.293475
2013-01-06 -1.531764 -1.028076

In [30]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.639829  1.257943
2013-01-03  1.158555 -1.316103
2013-01-04 -0.186922  0.393728

In [31]:
df.loc['20130102',['A','B']]

A   -0.639829
B    1.257943
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
df.loc[dates[0],'A']

0.7160486035711788

In [33]:
df.at[dates[0],'A']

0.7160486035711788

In [34]:
df.iloc[3]

A   -0.186922
B    0.393728
C   -1.295513
D   -0.061812
Name: 2013-01-04 00:00:00, dtype: float64

In [35]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.186922  0.393728
2013-01-05 -0.093003 -1.293475

In [36]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.639829 -0.480440
2013-01-03  1.158555  0.061438
2013-01-05 -0.093003  0.156667

In [40]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.639829  1.257943 -0.480440  0.165727
2013-01-03  1.158555 -1.316103  0.061438 -0.477489

In [44]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.615724 -0.263335
2013-01-02  1.257943 -0.480440
2013-01-03 -1.316103  0.061438
2013-01-04  0.393728 -1.295513
2013-01-05 -1.293475  0.156667
2013-01-06 -1.028076 -1.760545

In [45]:
df.iloc[1,1]

1.2579433236874429

In [46]:
df.iat[1,1]

1.2579433236874429

In [49]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.716049  1.615724 -0.263335 -1.060397
2013-01-03  1.158555 -1.316103  0.061438 -0.477489

In [50]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.716049  1.615724       NaN       NaN
2013-01-02       NaN  1.257943       NaN  0.165727
2013-01-03  1.158555       NaN  0.061438       NaN
2013-01-04       NaN  0.393728       NaN       NaN
2013-01-05       NaN       NaN  0.156667  0.027981
2013-01-06       NaN       NaN       NaN  0.714193

In [51]:
df2 = df.copy()

In [53]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [54]:
df2

                   A         B         C         D      E
2013-01-01  0.716049  1.615724 -0.263335 -1.060397    one
2013-01-02 -0.639829  1.257943 -0.480440  0.165727    one
2013-01-03  1.158555 -1.316103  0.061438 -0.477489    two
2013-01-04 -0.186922  0.393728 -1.295513 -0.061812  three
2013-01-05 -0.093003 -1.293475  0.156667  0.027981   four
2013-01-06 -1.531764 -1.028076 -1.760545  0.714193  three

In [55]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.158555 -1.316103  0.061438 -0.477489   two
2013-01-05 -0.093003 -1.293475  0.156667  0.027981  four

In [57]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20130102', periods=6))

In [58]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [59]:
df['F'] = s1

In [60]:
df.at[dates[0],'A'] = 0

In [61]:
df.iat[0,1] = 0

In [62]:
df.loc[:,'D'] = np.array([5] * len(df))

In [63]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.263335  5  NaN
2013-01-02 -0.639829  1.257943 -0.480440  5  1.0
2013-01-03  1.158555 -1.316103  0.061438  5  2.0
2013-01-04 -0.186922  0.393728 -1.295513  5  3.0
2013-01-05 -0.093003 -1.293475  0.156667  5  4.0
2013-01-06 -1.531764 -1.028076 -1.760545  5  5.0

In [64]:
df2 = df.copy()

In [65]:
df2[df2 > 0] = -df2

In [66]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.263335 -5  NaN
2013-01-02 -0.639829 -1.257943 -0.480440 -5 -1.0
2013-01-03 -1.158555 -1.316103 -0.061438 -5 -2.0
2013-01-04 -0.186922 -0.393728 -1.295513 -5 -3.0
2013-01-05 -0.093003 -1.293475 -0.156667 -5 -4.0
2013-01-06 -1.531764 -1.028076 -1.760545 -5 -5.0